#############################################################
# ~/.dotfiles/mac/Brewfile                                  #
#                                                           #
# List of packages to be installed / updated via Homebrew   #
# Usage: $ brew bundle --file ~/.dotfiles/mac/Brewfile      #
#############################################################

# Version Control
brew "git"          # Version control system
brew "gh"           # GitHub CLI for PRs, issues, etc.

# Editors
brew "neovim"       # Vim fork, modernized text editor

# CLI Tools
brew "bat"          # Syntax highlighting (better cat)
brew "duf"          # Disk usage stats (better df)
brew "jq"           # JSON processor
brew "ripgrep"      # Fast text search (better grep)
brew "thefuck"      # Auto-correct previous command
brew "tmux"         # Terminal multiplexer
brew "tree"         # Directory listing as a file-tree
brew "zoxide"       # Smarter cd command

# Languages & Runtimes
brew "fnm"          # Fast Node Manager (better nvm)
# brew "go"           # Go programming language

# Build Dependencies
brew "icu4c"        # Unicode library (pgenv dependency)
brew "pkg-config"   # Compiler helper for building software

# Apps
# cask "docker"              # Docker Desktop
cask "ghostty"             # GPU-accelerated terminal emulator
cask "hammerspoon"         # macOS automation scripting
cask "jetbrains-toolbox"   # JetBrains IDE manager
cask "raycast"             # Launcher and productivity tool
cask "visual-studio-code"  # Code editor


# brew bundle cleanup --file=~/path/to/Brewfile       # Shows what would be removed
#@brew bundle cleanup --file=~/path/to/Brewfile --force  # Actually removes them